cf/DataProcessors/УдалитьВосстановлениеПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>УдалитьВосстановлениеПартий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПродолжитьС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенСебестоимость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринудительноеПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОстатковВСеансеОтключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьЗаписьИсторииИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстанавливатсяЕслиНетВозможностиОпределитьСебестоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнестиТоварВСектуПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КосякТовар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерепроводитьТоварыГдеНеЗаполненаПартияВазукомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВПоступленииСебестоимостьБратьИзДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаполнятьПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазбиватьРазукомплектацияКогдаОднойПартииМало</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьПроверкуПослеПроведенияИОстанавливатьсяПриОшибке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОшибокПартионногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПартии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/DataProcessors/УдалитьВосстановлениеПартий/Forms/ФормаРасхождений/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ВидДвижения, Период, Регистратор, Склад, //МАКСИМУМ(Партия), 
	|	Количество, МАКСИМУМ(Товары), МАКСИМУМ(Партии)
	|ИЗ
	|(
	|	ВЫБРАТЬ	ВидДвижения, Период, Регистратор, Склад, //NULL Партия, 
	|			СУММА(Количество) Количество, Истина Товары, Ложь Партии
	|	ИЗ		РегистрНакопления.ТоварыНаСкладах
	|	ГДЕ		Номенклатура = &Номенклатура
	|	СГРУППИРОВАТЬ ПО ВидДвижения, Период, Регистратор, Склад
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ	ВидДвижения, Период, Регистратор, Склад, //Партия, 
	|			СУММА(Количество), Ложь, Истина
	|	ИЗ		РегистрНакопления.ПартииТоваров
	|	ГДЕ		Номенклатура = &Номенклатура
	|	СГРУППИРОВАТЬ ПО ВидДвижения, Период, Регистратор, Склад
	|) Запрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидДвижения, Период, Регистратор, Склад, Количество
	|
	|УПОРЯДОЧИТЬ ПО Период
	|");
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.КосякТовар);
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.КосякТовар = Параметры.Номенклатура;
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КосякТоварПриИзменении(Элемент)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ИмяДокумента(СсылкаДок)
	
	Возврат СсылкаДок.Метаданные().Имя;
	
КонецФункции
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("Документ." + ИмяДокумента(Элемент.ТекущиеДанные.Регистратор) + ".ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Регистратор));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстатки(Регистратор)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Склад, КоличествоОстаток Количество 								ИЗ РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментВремени, Номенклатура = &Номенклатура);
	|ВЫБРАТЬ Партия, Склад, КоличествоОстаток Количество, СуммаОстаток Сумма	ИЗ РегистрНакопления.ПартииТоваров.Остатки(&МоментВремени, Номенклатура = &Номенклатура)");
	
	Запрос.УстановитьПараметр("Номенклатура", 	Объект.КосякТовар);
	Запрос.УстановитьПараметр("МоментВремени", 	Новый МоментВремени(Регистратор.Дата, Регистратор));
	
	Пакет = Запрос.ВыполнитьПакет();
	ТоварыНаСкладах.Загрузить(Пакет[0].Выгрузить());
	ПартииТоваров.Загрузить(Пакет[1].Выгрузить());
	
КонецПроцедуры
&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ОбновитьОстатки(Элементы.Товары.ТекущиеДанные.Регистратор);
	
КонецПроцедуры
